; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	infrared3 - mode
	thermograph1 - mode
	spectrograph0 - mode
	image4 - mode
	thermograph2 - mode
	spectrograph6 - mode
	infrared5 - mode
	Star2 - direction
	GroundStation3 - direction
	GroundStation1 - direction
	GroundStation4 - direction
	GroundStation0 - direction
	Star5 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Star9 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 spectrograph6)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 image4)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 Star2)
	(supports instrument2 spectrograph6)
	(supports instrument2 infrared5)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation4)
	(supports instrument3 image4)
	(supports instrument3 infrared3)
	(calibration_target instrument3 GroundStation3)
	(supports instrument4 spectrograph6)
	(supports instrument4 infrared3)
	(supports instrument4 spectrograph0)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 GroundStation1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star8)
	(supports instrument5 image4)
	(calibration_target instrument5 GroundStation4)
	(supports instrument6 image4)
	(calibration_target instrument6 GroundStation0)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star9)
)
(:goal (and
	(pointing satellite0 GroundStation1)
	(pointing satellite1 GroundStation0)
	(pointing satellite2 Star8)
	(have_image Star5 infrared5)
	(have_image Planet6 thermograph1)
	(have_image Phenomenon7 infrared3)
	(have_image Phenomenon7 spectrograph0)
	(have_image Star8 thermograph2)
	(have_image Star8 thermograph1)
	(have_image Star9 image4)
	(have_image Star9 thermograph1)
))

)

; plan
1. (turn_to satellite1 groundstation1 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 groundstation1)
   goals met: 0 of 11
2. (turn_to satellite0 groundstation0 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 groundstation0)
   goals met: 0 of 11
3. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 11
4. (calibrate satellite0 instrument2 groundstation0)
   added: (calibrated instrument2)
   goals met: 0 of 11
5. (turn_to satellite0 star5 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star5)
   goals met: 0 of 11
6. (take_image satellite0 star5 instrument2 infrared5)
   added: (have_image star5 infrared5)
   goals met: 1 of 11
7. (turn_to satellite0 star2 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star2)
   goals met: 1 of 11
8. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 1 of 11
9. (switch_off instrument2 satellite0)
   deleted: (power_on instrument2)
   added: (power_avail satellite0)
   goals met: 1 of 11
10. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 11
11. (calibrate satellite1 instrument4 groundstation1)
   added: (calibrated instrument4)
   goals met: 1 of 11
12. (calibrate satellite0 instrument1 star2)
   added: (calibrated instrument1)
   goals met: 1 of 11
13. (turn_to satellite0 star8 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star8)
   goals met: 1 of 11
14. (take_image satellite0 star8 instrument1 thermograph2)
   added: (have_image star8 thermograph2)
   goals met: 2 of 11
15. (turn_to satellite0 star9 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star9)
   goals met: 2 of 11
16. (take_image satellite0 star9 instrument1 image4)
   added: (have_image star9 image4)
   goals met: 3 of 11
17. (turn_to satellite0 groundstation1 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 groundstation1)
   goals met: 4 of 11
18. (turn_to satellite1 phenomenon7 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 phenomenon7)
   goals met: 4 of 11
19. (take_image satellite1 phenomenon7 instrument4 infrared3)
   added: (have_image phenomenon7 infrared3)
   goals met: 5 of 11
20. (take_image satellite1 phenomenon7 instrument4 spectrograph0)
   added: (have_image phenomenon7 spectrograph0)
   goals met: 6 of 11
21. (turn_to satellite1 planet6 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 planet6)
   goals met: 6 of 11
22. (take_image satellite1 planet6 instrument4 thermograph1)
   added: (have_image planet6 thermograph1)
   goals met: 7 of 11
23. (turn_to satellite1 star8 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 star8)
   goals met: 7 of 11
24. (take_image satellite1 star8 instrument4 thermograph1)
   added: (have_image star8 thermograph1)
   goals met: 8 of 11
25. (turn_to satellite1 star9 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star9)
   goals met: 8 of 11
26. (take_image satellite1 star9 instrument4 thermograph1)
   added: (have_image star9 thermograph1)
   goals met: 9 of 11
27. (turn_to satellite1 groundstation0 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 groundstation0)
   goals met: 10 of 11
28. (turn_to satellite2 star8 star9)
   deleted: (pointing satellite2 star9)
   added: (pointing satellite2 star8)
   goals met: 11 of 11
